//#include <iostream>
//using namespace std;
//
////引用和指针的区别：
////1、引用必须初始化，指针没要求；
////2、引用在初始化引用一个实体后不能再引用其他实体，指针可以指向同一个类型的实体；
////3、没有NULL引用，有NULl指针；
////4、在sizeof中含义不同：引用是引用类型的大小，指针是地址空间所占字节个数；
////5、引用自加就是实体+1，指针自加加的是偏移量；
////6、引用没有多级，指针有多级指针；
////7、引用编译器自己处理，指针需要显示解引用;
////8、引用比指针安全.
//
//int main()
//{
//	int a = 10;
//	int& ra = a;
//
//	int* pa = &a;
//	*pa = 20;
//
//	cout << "&a = " << &a << endl;
//	cout << "&ra = " << &ra << endl;
//	cout << "&pa = " << pa << endl;
//
//	system("pause");
//	return 0;
//}
